{
    "chapter1":
    {
        "paragraph1":{
            """
            تسببت الحرب العالمية الأولى في خسائر ( نتائج )بشرية : تمثلت في سقوط ملايين القتلى و الجرحى و المعطوبين والمفقودين نتيجة للعمليات العسكرية أو من جراء المجاعات والأوبئة
            .و قد تفاوتت حدة هذه الخسائر بين الدول المتحاربة حيث تضررت منها كثيرا ألمانيا، فرنسا و النمسا ،كما أدت الحرب العالمية الأولى إلى نتائج اجتماعية في تزايد في نسب البطالة و الفقر و البؤس الاجتماعي و انتشار المجاعة.
            وارتفاع نسبة الشيوخ مقابل انخفاض نسبة السكان النشيطين .بالإضافة إلى خروج المرأة إلى العمل لتعويض النقص الحاصل في اليد العاملة .كما تسببت الحرب في خسائر( نتائج ) اقتصادية جسيمة تجلت في تدمير البنية التحتية و المرافق الإنتاجية فانخفض بذلك الإنتاج الفلاحي و الصناعي و تدهورت المبادلات التجارية.
            وارتفعت مديونية الدول الأوربية بفعل ارتفاع تكاليف الحرب. وتراجعت مكانة أوربا اقتصاديا ، حيث انتقل مركز الثقل الاقتصادي و المالي من بورصة لندن الى بورصة نيويورك.
            تميز مؤتمر السلام المنعقد بقصر فرساي بباريس سنة 1919م بهيمنة مجلس الأربعة الكبار (فرنسا، انجلترا، ايطاليا، الولايات المتحدة الامريكية) وقد ترتب عنه فرض معاهدة فرساي على المانيا و التي تضمنت عقوبات قاسية كاقتطاع أجزاء من أراضيها لفائدة الدول المنتصرة. ونزع سلاحها و تقليص عدد جنودها. ودفع غرامة مالية قدرها 132 مليار مارك الماني.
            كما فرض الحلفاء معاهدات اخرى على باقي الدول المنهزمة مثل معاهدة سان جرمان (شتنبر1919م): ضد النمسا و تم بموجبها فصل النمسا عن هنغاريا و الاعتراف باستقلال القوميات. ومعاهدة نويي (نونير 1919م) ضد بلغاريا تم اقتطاع أجزاء من أراضيها لصالح الدول المجاورة. ثم معاهدة سيفر (غشت 1920م) : ضد الإمبراطورية العثمانية ونصت على تفكيك الإمبراطورية واقتطاع أجزاء منها لصالح الدول الأوربية
            تغيرت الخريطة السياسية بأوروبا بعد الحرب العالمية الأولى، بظهور دول جديدة (بولونيا، تشيكوسلوفاكيا، يوغوسلافيا، دول البلطيق) واختفاء الامبراطوريات التقليدية (الامبراطورية الالمانية، النمسا-هنغاريا، روسيا القيصرية) وتوسع مساحة الدول المنتصرة على حساب الدول المنهزمة. واسترجاع فرنسا لمنطقتي الالزاس و اللورين. كما تأسست عصبة الأمم كمنظمة دولية سنة 1920م استنادا للمبادئ الأربعة عشر التي جاء بها الرئيس الأمريكي ويلسون. ، مهمتها الحفاظ على السلم و الامن الدوليين و قد اتخذت من جنيف بسويسرا مقرا لها و تضم عصبة الامم عدة اجهزة تسهر على تحقيق اهدافها أهمها مجلس العصبة ،الجمعية العامة محكمة العدل...
            """
            
        }
    }
}   